Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2014
 Syntax
  C#
public bool TargetIsHookBend()
  Visual Basic
Public Function TargetIsHookBend As Boolean
  Visual C++
public:
bool TargetIsHookBend()
 See Also
  RebarConstraint Class
  Autodesk.Revit.DB.Structure Namespace